{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_9", "layers": [{"name": "the_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 64, 1], "dtype": "float32", "sparse": false, "name": "the_input"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["the_input", 0, 0, {}]]]}, {"name": "max1", "class_name": "MaxPooling2D", "config": {"name": "max1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max1", 0, 0, {}]]]}, {"name": "max2", "class_name": "MaxPooling2D", "config": {"name": "max2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "reshape", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "target_shape": [32, 256]}, "inbound_nodes": [[["max2", 0, 0, {}]]]}, {"name": "dense1", "class_name": "Dense", "config": {"name": "dense1", "trainable": true, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"name": "gru1", "class_name": "GRU", "config": {"name": "gru1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["dense1", 0, 0, {}]]]}, {"name": "gru1_b", "class_name": "GRU", "config": {"name": "gru1_b", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": true, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["dense1", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["gru1", 0, 0, {}], ["gru1_b", 0, 0, {}]]]}, {"name": "gru2", "class_name": "GRU", "config": {"name": "gru2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "gru2_b", "class_name": "GRU", "config": {"name": "gru2_b", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": true, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "inbound_nodes": [[["gru2", 0, 0, {}], ["gru2_b", 0, 0, {}]]]}, {"name": "dense2", "class_name": "Dense", "config": {"name": "dense2", "trainable": true, "units": 23, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "softmax", "class_name": "Activation", "config": {"name": "softmax", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense2", 0, 0, {}]]]}], "input_layers": [["the_input", 0, 0]], "output_layers": [["softmax", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"name": "conv1/kernel", "shape": [3, 3, 1, 16], "dtype": "float32", "quantization": {"min": -0.8795268236422071, "scale": 0.00778342321807263, "dtype": "uint8"}}, {"name": "conv1/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -0.38334052247159617, "scale": 0.002426205838427824, "dtype": "uint8"}}, {"name": "conv2/kernel", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"min": -0.8735302616568172, "scale": 0.006932779854419185, "dtype": "uint8"}}, {"name": "conv2/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -0.1121069033356274, "scale": 0.0020760537654745813, "dtype": "uint8"}}, {"name": "dense1/kernel", "shape": [256, 32], "dtype": "float32", "quantization": {"min": -0.6423763462141449, "scale": 0.0061766956366744695, "dtype": "uint8"}}, {"name": "dense1/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.20880642410586864, "scale": 0.0014808966248643165, "dtype": "uint8"}}, {"name": "dense2/kernel", "shape": [1024, 23], "dtype": "float32", "quantization": {"min": -0.3785774020587697, "scale": 0.0032357042911005957, "dtype": "uint8"}}, {"name": "dense2/bias", "shape": [23], "dtype": "float32", "quantization": {"min": -0.10930357931875714, "scale": 0.004203983819952198, "dtype": "uint8"}}, {"name": "gru1/kernel", "shape": [32, 1536], "dtype": "float32", "quantization": {"min": -0.52042984307981, "scale": 0.004065858149061016, "dtype": "uint8"}}, {"name": "gru1/recurrent_kernel", "shape": [512, 1536], "dtype": "float32", "quantization": {"min": -0.12710567782906923, "scale": 0.001000832108890309, "dtype": "uint8"}}, {"name": "gru1/bias", "shape": [1536], "dtype": "float32", "quantization": {"min": -0.11980655841967638, "scale": 0.0009820209706530852, "dtype": "uint8"}}, {"name": "gru1_b/kernel", "shape": [32, 1536], "dtype": "float32", "quantization": {"min": -0.526676462210861, "scale": 0.004114659861022351, "dtype": "uint8"}}, {"name": "gru1_b/recurrent_kernel", "shape": [512, 1536], "dtype": "float32", "quantization": {"min": -0.13591544917401147, "scale": 0.0010219206704812891, "dtype": "uint8"}}, {"name": "gru1_b/bias", "shape": [1536], "dtype": "float32", "quantization": {"min": -0.1342821723105861, "scale": 0.0010329397870045083, "dtype": "uint8"}}, {"name": "gru2/kernel", "shape": [512, 1536], "dtype": "float32", "quantization": {"min": -0.15252390293514026, "scale": 0.001210507166151907, "dtype": "uint8"}}, {"name": "gru2/recurrent_kernel", "shape": [512, 1536], "dtype": "float32", "quantization": {"min": -0.11619460980097453, "scale": 0.0009764252924451641, "dtype": "uint8"}}, {"name": "gru2/bias", "shape": [1536], "dtype": "float32", "quantization": {"min": -0.09701632576830246, "scale": 0.0006784358445335837, "dtype": "uint8"}}, {"name": "gru2_b/kernel", "shape": [512, 1536], "dtype": "float32", "quantization": {"min": -0.1626730915962481, "scale": 0.0012231059518514895, "dtype": "uint8"}}, {"name": "gru2_b/recurrent_kernel", "shape": [512, 1536], "dtype": "float32", "quantization": {"min": -0.11897867134973114, "scale": 0.00097523501106337, "dtype": "uint8"}}, {"name": "gru2_b/bias", "shape": [1536], "dtype": "float32", "quantization": {"min": -0.08548858823145136, "scale": 0.0008635210932469835, "dtype": "uint8"}}]}]}