{"modelTopology": {"keras_version": "2.1.6", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_7", "layers": [{"name": "the_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 64, 1], "dtype": "float32", "sparse": false, "name": "the_input"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["the_input", 0, 0, {}]]]}, {"name": "max1", "class_name": "MaxPooling2D", "config": {"name": "max1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["max1", 0, 0, {}]]]}, {"name": "max2", "class_name": "MaxPooling2D", "config": {"name": "max2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "reshape", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "target_shape": [32, 256]}, "inbound_nodes": [[["max2", 0, 0, {}]]]}, {"name": "dense1", "class_name": "Dense", "config": {"name": "dense1", "trainable": true, "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape", 0, 0, {}]]]}, {"name": "gru1", "class_name": "GRU", "config": {"name": "gru1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["dense1", 0, 0, {}]]]}, {"name": "gru1_b", "class_name": "GRU", "config": {"name": "gru1_b", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": true, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["dense1", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["gru1", 0, 0, {}], ["gru1_b", 0, 0, {}]]]}, {"name": "gru2", "class_name": "GRU", "config": {"name": "gru2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "gru2_b", "class_name": "GRU", "config": {"name": "gru2_b", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": true, "stateful": false, "unroll": false, "units": 512, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 1, "reset_after": false}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": -1}, "inbound_nodes": [[["gru2", 0, 0, {}], ["gru2_b", 0, 0, {}]]]}, {"name": "dense2", "class_name": "Dense", "config": {"name": "dense2", "trainable": true, "units": 34, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "softmax", "class_name": "Activation", "config": {"name": "softmax", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense2", 0, 0, {}]]]}], "input_layers": [["the_input", 0, 0]], "output_layers": [["softmax", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of2", "group1-shard2of2"], "weights": [{"name": "conv1/kernel", "shape": [3, 3, 1, 16], "dtype": "float32", "quantization": {"min": -1.3442161831201291, "scale": 0.010340124485539455, "dtype": "uint8"}}, {"name": "conv1/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -0.49524146131440705, "scale": 0.0035628882108950147, "dtype": "uint8"}}, {"name": "conv2/kernel", "shape": [3, 3, 16, 16], "dtype": "float32", "quantization": {"min": -0.5094290936694426, "scale": 0.004851705653994691, "dtype": "uint8"}}, {"name": "conv2/bias", "shape": [16], "dtype": "float32", "quantization": {"min": -0.6342290534692652, "scale": 0.004697992988661224, "dtype": "uint8"}}, {"name": "dense1/kernel", "shape": [256, 32], "dtype": "float32", "quantization": {"min": -0.49778636062846465, "scale": 0.004014406134100521, "dtype": "uint8"}}, {"name": "dense1/bias", "shape": [32], "dtype": "float32", "quantization": {"min": -0.3088385753771838, "scale": 0.002782329507902557, "dtype": "uint8"}}, {"name": "dense2/kernel", "shape": [1024, 34], "dtype": "float32", "quantization": {"min": -0.3359324912230174, "scale": 0.002822962111117793, "dtype": "uint8"}}, {"name": "dense2/bias", "shape": [34], "dtype": "float32", "quantization": {"min": -0.04971387982368469, "scale": 0.0014621729359907262, "dtype": "uint8"}}, {"name": "gru1/kernel", "shape": [32, 1536], "dtype": "float32", "quantization": {"min": -0.5156967653947718, "scale": 0.004092831471387078, "dtype": "uint8"}}, {"name": "gru1/recurrent_kernel", "shape": [512, 1536], "dtype": "float32", "quantization": {"min": -0.13163058827905094, "scale": 0.0009972014263564465, "dtype": "uint8"}}, {"name": "gru1/bias", "shape": [1536], "dtype": "float32", "quantization": {"min": -0.08661986501777874, "scale": 0.0006276801812882517, "dtype": "uint8"}}, {"name": "gru1_b/kernel", "shape": [32, 1536], "dtype": "float32", "quantization": {"min": -0.5266925886565563, "scale": 0.004114785848879346, "dtype": "uint8"}}, {"name": "gru1_b/recurrent_kernel", "shape": [512, 1536], "dtype": "float32", "quantization": {"min": -0.12394049868864171, "scale": 0.0009836547514971564, "dtype": "uint8"}}, {"name": "gru1_b/bias", "shape": [1536], "dtype": "float32", "quantization": {"min": -0.07180687995517955, "scale": 0.0006190248271998237, "dtype": "uint8"}}, {"name": "gru2/kernel", "shape": [512, 1536], "dtype": "float32", "quantization": {"min": -0.15867245244044884, "scale": 0.0012396285346910065, "dtype": "uint8"}}, {"name": "gru2/recurrent_kernel", "shape": [512, 1536], "dtype": "float32", "quantization": {"min": -0.11834734137736115, "scale": 0.0009467787310188892, "dtype": "uint8"}}, {"name": "gru2/bias", "shape": [1536], "dtype": "float32", "quantization": {"min": -0.05383464834269355, "scale": 0.00039010614741082284, "dtype": "uint8"}}, {"name": "gru2_b/kernel", "shape": [512, 1536], "dtype": "float32", "quantization": {"min": -0.15969974737541348, "scale": 0.0012775979790033078, "dtype": "uint8"}}, {"name": "gru2_b/recurrent_kernel", "shape": [512, 1536], "dtype": "float32", "quantization": {"min": -0.12434786587369208, "scale": 0.0009565220451822467, "dtype": "uint8"}}, {"name": "gru2_b/bias", "shape": [1536], "dtype": "float32", "quantization": {"min": -0.03843425652560066, "scale": 0.0003558727456074135, "dtype": "uint8"}}]}]}